<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b8c3ac9901b88c1c58566168e67556e84e6829ab9eede047d5616ef2667580ed","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1344 at https://github.com/cal-itp/data-infra/actions/runs/20969952839","plan_out_hash":"0c4c71eb917df4e390ef563d3d28b0696303e2c4123926f8fbc00163b5ce846d","plan_hash":"4ceafa29691324f41ca52f432fc5df9205840cc733d9a2df6fe1f72b5c0edcff","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "T3iT2Q==" -> (known after apply)
!~      detect_md5hash      = "/Aq78xQsxixaNhFLi7lerA==" -> "different hash"
!~      generation          = 1767986275211319 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "/Aq78xQsxixaNhFLi7lerA==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/payments/_payments.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "u7oQTQ==" -> (known after apply)
!~      detect_md5hash      = "wLmnrdN+f5tBA3MWS+icfg==" -> "different hash"
!~      generation          = 1757087492191331 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/payments/_payments.yml"
!~      md5hash             = "wLmnrdN+f5tBA3MWS+icfg==" -> (known after apply)
        name                = "data/warehouse/models/mart/payments/_payments.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "1gAzsg==" -> (known after apply)
!~      detect_md5hash      = "7E7UGupuXzQYe6ENd8jzdg==" -> "different hash"
!~      generation          = 1767986275850384 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "7E7UGupuXzQYe6ENd8jzdg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1344](https://github.com/cal-itp/data-infra/actions/runs/20969952839)